app/controllers/registrations_controller.rb

  def update
    user = User.find(params[:id])
    if user.update_without_password(my_user_params.except(:password))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "cover_image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["cover_image", "https://image.tmdb.org/t/p/w1400_and_h450_face/n1y094tVDFATSzkTnFxoGZ1qNsG.jpg"], ["updated_at", "2018-08-30 00:53:35.267040"], ["id", 1]]