app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("title", "movie_review", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "t"], ["movie_review", "t"], ["rating", 5.0], ["created_at", "2018-08-14 00:28:47.192027"], ["updated_at", "2018-08-14 00:28:47.192027"]]
---
  def create

    @review = Review.new(title:params[:title],rating:params[:rating,],movie_review:params[:movie_review])

    respond_to do |format|
      if @review.save