app/controllers/users_controller.rb

UPDATE "users" SET "top_movies" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["top_movies", "<26 bytes of binary data>"], ["updated_at", "2018-08-29 23:40:53.880766"], ["id", 1]]
---
  def addmovie
    @addmovieid = params[:id]
    current_user.top_movies << @addmovieid
    current_user.save